[
  { 
    "title": "Booki – Intégration d'une maquette responsive (HTML/CSS)",
    "description": "Booki est une plateforme web de recherche d’hébergements et d’activités, développée avec une approche centrée sur la performance et l’accessibilité. L’objectif était de transformer une maquette en un site entièrement responsive, en assurant une expérience fluide sur tous types d’écrans (mobile, tablette et desktop).",
    "problems": "Les principales difficultés ont concerné la mise en page avec Flexbox et la gestion des media queries. J’ai surmonté ces défis en structurant soigneusement le code HTML et en ajustant les media queries pour un rendu optimal sur mobile, tablette et desktop.",
    "skills": "Maîtrise de l'intégration HTML5/CSS3, amélioration des compétences en mise en page avec Flexbox, conception de design responsive et structuration sémantique optimisée.",
    "link": "[à ajouter]",
"images": [
  {
    "src": "assets/images/projets/image1.webp",
    "alt": "Aperçu du projet - Haut de la landing page du site Booki"
  },
  {
    "src": "assets/images/projets/image2.webp",
    "alt": "Aperçu du projet - Bas de la landing page du site Booki"
  },
  {
    "src": "assets/images/projets/image3.webp",
    "alt": "Aperçu du projet - Vue de la version mobile du site Booki"
  }
],
    "technologies": [
      { "name": "HTML5", "icon": "devicon-html5-plain colored" },
      { "name": "CSS3", "icon": "devicon-css3-plain colored" },
      { "name": "Git", "icon": "devicon-git-plain colored" },
      { "name": "GitHub", "icon": "devicon-github-original" },
      { "name": "VS Code", "icon": "devicon-vscode-plain colored" },
      { "name": "WSL2", "icon": "devicon-linux-plain colored" }
    ]
  },
  {
    "title": "Kaza – Développement d'une application de location immobilière (React)",
    "description": "Kaza est une application front-end de location immobilière développée avec React, visant à offrir une interface utilisateur moderne et dynamique.",
    "problems": "Le projet ne présentait pas de grandes difficultés techniques, mais j'ai dû être attentif à la portée et à la modularité des composants afin de maintenir une architecture claire et évolutive. Le plus gros défi a été lié au déploiement, en particulier la redirection 404 qui posait problème.",
    "skills": "Développement avec React, structuration et modularisation des composants, bonnes pratiques de déploiement et optimisation de l'architecture front-end.",
    "link": "[à ajouter]",
    "images": [
  {
    "src": "assets/images/projets/image19.webp",
    "alt": "Aperçu du projet - Landing de l'app Kaza"
  },
  {
    "src": "assets/images/projets/image20.webp",
    "alt": "Aperçu du projet - Détail d'une annonce de l'app Kaza"
  },
  {
    "src": "assets/images/projets/image21.webp",
    "alt": "Aperçu du projet - Page à propos de l'app Kaza"
  }
],
    "technologies": [
      { "name": "React", "icon": "devicon-react-original colored" },
      { "name": "JavaScript", "icon": "devicon-javascript-plain colored" },
      { "name": "SCSS", "icon": "devicon-sass-original colored" },
      { "name": "Linux", "icon": "devicon-linux-plain colored" },
      { "name": "Git", "icon": "devicon-git-plain colored" },
      { "name": "GitHub", "icon": "devicon-github-original" },
      { "name": "VS Code", "icon": "devicon-vscode-plain colored" },
      { "name": "NPM", "icon": "devicon-npm-original-wordmark colored" },
      { "name": "Yarn", "icon": "devicon-yarn-plain colored" }
    ]
  },
  {
    "title": "Mon Vieux Grimoire – Développement d'une API REST (Node.js/Express)",
    "description": "Mon Vieux Grimoire est une API backend de gestion de livres réalisée en Node.js avec Express. Le projet visait à créer un serveur sécurisé et performant tout en manipulant une base de données.",
    "problems": "La principale difficulté a été de m'adapter à un environnement backend, notamment dans la gestion des middlewares, des statuts de réponse HTTP et de la logique serveur. J'ai appris à concevoir des routes API robustes et à gérer les erreurs de manière cohérente.",
    "skills": "Développement backend avec Node.js et Express, conception d’API REST, gestion des middlewares, sécurité et interactions avec les bases de données.",
    "link": "[à ajouter]",
    "images": [
  {
    "src": "assets/images/projets/image8.webp",
    "alt": "Aperçu du projet - Détail d'un ouvrage sur le site Mon Vieux Grimoire"
  },
  {
    "src": "assets/images/projets/image14.webp",
    "alt": "Aperçu du projet - Page de connection du site Mon Vieux Grimoire"
  },
  {
    "src": "assets/images/projets/image15.webp",
    "alt": "Aperçu du projet - formulaire d'ajout d'un ouvrage sur le site Mon Vieux Grimoire"
  },
  {
    "src": "assets/images/projets/image9.webp",
    "alt": "Aperçu du projet - Détail de la collection books sur mongoDB"
  }
],
    "technologies": [
      { "name": "Node.js", "icon": "devicon-nodejs-plain colored" },
      { "name": "Express", "icon": "devicon-express-original" },
      { "name": "MongoDB", "icon": "devicon-mongodb-plain colored" },
      { "name": "Linux", "icon": "devicon-linux-plain colored" },
      { "name": "Git", "icon": "devicon-git-plain colored" },
      { "name": "GitHub", "icon": "devicon-github-original" },
      { "name": "VS Code", "icon": "devicon-vscode-plain colored" },
      { "name": "NPM", "icon": "devicon-npm-original-wordmark colored" }
    ]
  }
]